results/results_r5_large/results_r5_large_run1/oltp_read_write_t16/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 47.99 qps: 977.60 (r/w/o: 685.96/49.19/242.45) lat (ms,95%): 569.67 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 45.30 qps: 907.42 (r/w/o: 636.12/46.60/224.71) lat (ms,95%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 48.60 qps: 970.20 (r/w/o: 678.80/50.20/241.20) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 46.70 qps: 935.90 (r/w/o: 655.40/49.10/231.40) lat (ms,95%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 47.60 qps: 950.00 (r/w/o: 664.80/49.40/235.80) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 46.90 qps: 939.00 (r/w/o: 657.20/48.70/233.10) lat (ms,95%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 44.70 qps: 893.10 (r/w/o: 624.90/46.60/221.60) lat (ms,95%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 47.60 qps: 949.40 (r/w/o: 665.00/49.60/234.80) lat (ms,95%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 48.80 qps: 977.40 (r/w/o: 684.40/50.40/242.60) lat (ms,95%): 569.67 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 46.20 qps: 926.50 (r/w/o: 648.70/49.30/228.50) lat (ms,95%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 47.70 qps: 949.60 (r/w/o: 664.00/50.10/235.50) lat (ms,95%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 46.40 qps: 932.29 (r/w/o: 652.89/48.50/230.90) lat (ms,95%): 612.21 err/s: 0.10 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            79268
        write:                           5892
        other:                           28079
        total:                           113239
    transactions:                        5661   (47.02 per sec.)
    queries:                             113239 (940.57 per sec.)
    ignored errors:                      1      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      47.0205
    time elapsed:                        120.3942s
    total number of events:              5661

Latency (ms):
         min:                                  110.30
         avg:                                  339.82
         max:                                  996.01
         95th percentile:                      601.29
         sum:                              1923706.88

Threads fairness:
    events (avg/stddev):           353.8125/5.41
    execution time (avg/stddev):   120.2317/0.13